Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.0.110/include/pio/pic32cm1216le00048.h
#define PIN_PA18K_I2S_FS0                          _UL_(18)    
#define MUX_PA18K_I2S_FS0                          _UL_(10)    
#define PINMUX_PA18K_I2S_FS0                       ((PIN_PA18K_I2S_FS0 << 16) | MUX_PA18K_I2S_FS0)
#define PORT_PA18K_I2S_FS0                         (_UL_(1) << 18)

#define PIN_PA09K_I2S_MCK0                         _UL_(9)     
#define MUX_PA09K_I2S_MCK0                         _UL_(10)    
#define PINMUX_PA09K_I2S_MCK0                      ((PIN_PA09K_I2S_MCK0 << 16) | MUX_PA09K_I2S_MCK0)
#define PORT_PA09K_I2S_MCK0                        (_UL_(1) << 9)

#define PIN_PA10K_I2S_SCK0                         _UL_(10)    
#define MUX_PA10K_I2S_SCK0                         _UL_(10)    
#define PINMUX_PA10K_I2S_SCK0                      ((PIN_PA10K_I2S_SCK0 << 16) | MUX_PA10K_I2S_SCK0)
#define PORT_PA10K_I2S_SCK0                        (_UL_(1) << 10)

#define PIN_PA20K_I2S_SCK0                         _UL_(20)    
#define MUX_PA20K_I2S_SCK0                         _UL_(10)    
#define PINMUX_PA20K_I2S_SCK0                      ((PIN_PA20K_I2S_SCK0 << 16) | MUX_PA20K_I2S_SCK0)
#define PORT_PA20K_I2S_SCK0                        (_UL_(1) << 20)

#define PIN_PA21K_I2S_SCK1                         _UL_(21)    
#define MUX_PA21K_I2S_SCK1                         _UL_(10)    
#define PINMUX_PA21K_I2S_SCK1                      ((PIN_PA21K_I2S_SCK1 << 16) | MUX_PA21K_I2S_SCK1)
#define PORT_PA21K_I2S_SCK1                        (_UL_(1) << 21)

#define PIN_PA08K_I2S_SDI                          _UL_(8)     
#define MUX_PA08K_I2S_SDI                          _UL_(10)    
#define PINMUX_PA08K_I2S_SDI                       ((PIN_PA08K_I2S_SDI << 16) | MUX_PA08K_I2S_SDI)
#define PORT_PA08K_I2S_SDI                         (_UL_(1) << 8)

#define PIN_PA19K_I2S_SDO                          _UL_(19)    
#define MUX_PA19K_I2S_SDO                          _UL_(10)    
#define PINMUX_PA19K_I2S_SDO                       ((PIN_PA19K_I2S_SDO << 16) | MUX_PA19K_I2S_SDO)
#define PORT_PA19K_I2S_SDO                         (_UL_(1) << 19)

/* ========== PORT definition for OPAMP peripheral ========== */
#define PIN_PA02B_OPAMP_OANEG0                     _UL_(2)     
#define MUX_PA02B_OPAMP_OANEG0                     _UL_(1)     
#define PINMUX_PA02B_OPAMP_OANEG0                  ((PIN_PA02B_OPAMP_OANEG0 << 16) | MUX_PA02B_OPAMP_OANEG0)
#define PORT_PA02B_OPAMP_OANEG0                    (_UL_(1) << 2)

#define PIN_PA00B_OPAMP_OANEG1                     _UL_(0)     
#define MUX_PA00B_OPAMP_OANEG1                     _UL_(1)     
#define PINMUX_PA00B_OPAMP_OANEG1                  ((PIN_PA00B_OPAMP_OANEG1 << 16) | MUX_PA00B_OPAMP_OANEG1)
#define PORT_PA00B_OPAMP_OANEG1                    (_UL_(1) << 0)

#define PIN_PA03B_OPAMP_OANEG2                     _UL_(3)     
#define MUX_PA03B_OPAMP_OANEG2                     _UL_(1)     
#define PINMUX_PA03B_OPAMP_OANEG2                  ((PIN_PA03B_OPAMP_OANEG2 << 16) | MUX_PA03B_OPAMP_OANEG2)
#define PORT_PA03B_OPAMP_OANEG2                    (_UL_(1) << 3)

#define PIN_PA07B_OPAMP_OAOUT0                     _UL_(7)     
#define MUX_PA07B_OPAMP_OAOUT0                     _UL_(1)     
#define PINMUX_PA07B_OPAMP_OAOUT0                  ((PIN_PA07B_OPAMP_OAOUT0 << 16) | MUX_PA07B_OPAMP_OAOUT0)
#define PORT_PA07B_OPAMP_OAOUT0                    (_UL_(1) << 7)

#define PIN_PA04B_OPAMP_OAOUT2                     _UL_(4)     
#define MUX_PA04B_OPAMP_OAOUT2                     _UL_(1)     
#define PINMUX_PA04B_OPAMP_OAOUT2                  ((PIN_PA04B_OPAMP_OAOUT2 << 16) | MUX_PA04B_OPAMP_OAOUT2)
#define PORT_PA04B_OPAMP_OAOUT2                    (_UL_(1) << 4)

#define PIN_PA06B_OPAMP_OAPOS0                     _UL_(6)     
#define MUX_PA06B_OPAMP_OAPOS0                     _UL_(1)     
#define PINMUX_PA06B_OPAMP_OAPOS0                  ((PIN_PA06B_OPAMP_OAPOS0 << 16) | MUX_PA06B_OPAMP_OAPOS0)
#define PORT_PA06B_OPAMP_OAPOS0                    (_UL_(1) << 6)

#define PIN_PA01B_OPAMP_OAPOS1                     _UL_(1)     
#define MUX_PA01B_OPAMP_OAPOS1                     _UL_(1)     
#define PINMUX_PA01B_OPAMP_OAPOS1                  ((PIN_PA01B_OPAMP_OAPOS1 << 16) | MUX_PA01B_OPAMP_OAPOS1)
#define PORT_PA01B_OPAMP_OAPOS1                    (_UL_(1) << 1)

#define PIN_PA05B_OPAMP_OAPOS2                     _UL_(5)     
#define MUX_PA05B_OPAMP_OAPOS2                     _UL_(1)     
#define PINMUX_PA05B_OPAMP_OAPOS2                  ((PIN_PA05B_OPAMP_OAPOS2 << 16) | MUX_PA05B_OPAMP_OAPOS2)
#define PORT_PA05B_OPAMP_OAPOS2                    (_UL_(1) << 5)

/* ========== PORT definition for PTC peripheral ========== */
#define PIN_PA00F_PTC_DRV0                         _UL_(0)     
#define MUX_PA00F_PTC_DRV0                         _UL_(5)     
#define PINMUX_PA00F_PTC_DRV0                      ((PIN_PA00F_PTC_DRV0 << 16) | MUX_PA00F_PTC_DRV0)
#define PORT_PA00F_PTC_DRV0                        (_UL_(1) << 0)

#define PIN_PA01F_PTC_DRV1                         _UL_(1)     
#define MUX_PA01F_PTC_DRV1                         _UL_(5)     
#define PINMUX_PA01F_PTC_DRV1                      ((PIN_PA01F_PTC_DRV1 << 16) | MUX_PA01F_PTC_DRV1)
#define PORT_PA01F_PTC_DRV1                        (_UL_(1) << 1)

#define PIN_PA02F_PTC_DRV2                         _UL_(2)     
#define MUX_PA02F_PTC_DRV2                         _UL_(5)     
#define PINMUX_PA02F_PTC_DRV2                      ((PIN_PA02F_PTC_DRV2 << 16) | MUX_PA02F_PTC_DRV2)
#define PORT_PA02F_PTC_DRV2                        (_UL_(1) << 2)

#define PIN_PA03F_PTC_DRV3                         _UL_(3)     
#define MUX_PA03F_PTC_DRV3                         _UL_(5)     
#define PINMUX_PA03F_PTC_DRV3                      ((PIN_PA03F_PTC_DRV3 << 16) | MUX_PA03F_PTC_DRV3)
#define PORT_PA03F_PTC_DRV3                        (_UL_(1) << 3)

#define PIN_PA05F_PTC_DRV4                         _UL_(5)     
#define MUX_PA05F_PTC_DRV4                         _UL_(5)     
#define PINMUX_PA05F_PTC_DRV4                      ((PIN_PA05F_PTC_DRV4 << 16) | MUX_PA05F_PTC_DRV4)
#define PORT_PA05F_PTC_DRV4                        (_UL_(1) << 5)

