Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.0.110/include/pio/pic32cm1216le00048.h
#define PIN_PA02B_PTC_X2                           _UL_(2)     
#define MUX_PA02B_PTC_X2                           _UL_(1)     
#define PINMUX_PA02B_PTC_X2                        ((PIN_PA02B_PTC_X2 << 16) | MUX_PA02B_PTC_X2)
#define PORT_PA02B_PTC_X2                          (_UL_(1) << 2)

#define PIN_PA03B_PTC_X3                           _UL_(3)     
#define MUX_PA03B_PTC_X3                           _UL_(1)     
#define PINMUX_PA03B_PTC_X3                        ((PIN_PA03B_PTC_X3 << 16) | MUX_PA03B_PTC_X3)
#define PORT_PA03B_PTC_X3                          (_UL_(1) << 3)

#define PIN_PA05B_PTC_X4                           _UL_(5)     
#define MUX_PA05B_PTC_X4                           _UL_(1)     
#define PINMUX_PA05B_PTC_X4                        ((PIN_PA05B_PTC_X4 << 16) | MUX_PA05B_PTC_X4)
#define PORT_PA05B_PTC_X4                          (_UL_(1) << 5)

#define PIN_PA06B_PTC_X5                           _UL_(6)     
#define MUX_PA06B_PTC_X5                           _UL_(1)     
#define PINMUX_PA06B_PTC_X5                        ((PIN_PA06B_PTC_X5 << 16) | MUX_PA06B_PTC_X5)
#define PORT_PA06B_PTC_X5                          (_UL_(1) << 6)

#define PIN_PA08B_PTC_X6                           _UL_(8)     
#define MUX_PA08B_PTC_X6                           _UL_(1)     
#define PINMUX_PA08B_PTC_X6                        ((PIN_PA08B_PTC_X6 << 16) | MUX_PA08B_PTC_X6)
#define PORT_PA08B_PTC_X6                          (_UL_(1) << 8)

#define PIN_PA09B_PTC_X7                           _UL_(9)     
#define MUX_PA09B_PTC_X7                           _UL_(1)     
#define PINMUX_PA09B_PTC_X7                        ((PIN_PA09B_PTC_X7 << 16) | MUX_PA09B_PTC_X7)
#define PORT_PA09B_PTC_X7                          (_UL_(1) << 9)

#define PIN_PA10B_PTC_X8                           _UL_(10)    
#define MUX_PA10B_PTC_X8                           _UL_(1)     
#define PINMUX_PA10B_PTC_X8                        ((PIN_PA10B_PTC_X8 << 16) | MUX_PA10B_PTC_X8)
#define PORT_PA10B_PTC_X8                          (_UL_(1) << 10)

#define PIN_PA11B_PTC_X9                           _UL_(11)    
#define MUX_PA11B_PTC_X9                           _UL_(1)     
#define PINMUX_PA11B_PTC_X9                        ((PIN_PA11B_PTC_X9 << 16) | MUX_PA11B_PTC_X9)
#define PORT_PA11B_PTC_X9                          (_UL_(1) << 11)

#define PIN_PA14B_PTC_X10                          _UL_(14)    
#define MUX_PA14B_PTC_X10                          _UL_(1)     
#define PINMUX_PA14B_PTC_X10                       ((PIN_PA14B_PTC_X10 << 16) | MUX_PA14B_PTC_X10)
#define PORT_PA14B_PTC_X10                         (_UL_(1) << 14)

#define PIN_PA15B_PTC_X11                          _UL_(15)    
#define MUX_PA15B_PTC_X11                          _UL_(1)     
#define PINMUX_PA15B_PTC_X11                       ((PIN_PA15B_PTC_X11 << 16) | MUX_PA15B_PTC_X11)
#define PORT_PA15B_PTC_X11                         (_UL_(1) << 15)

#define PIN_PA16B_PTC_X12                          _UL_(16)    
#define MUX_PA16B_PTC_X12                          _UL_(1)     
#define PINMUX_PA16B_PTC_X12                       ((PIN_PA16B_PTC_X12 << 16) | MUX_PA16B_PTC_X12)
#define PORT_PA16B_PTC_X12                         (_UL_(1) << 16)

#define PIN_PA17B_PTC_X13                          _UL_(17)    
#define MUX_PA17B_PTC_X13                          _UL_(1)     
#define PINMUX_PA17B_PTC_X13                       ((PIN_PA17B_PTC_X13 << 16) | MUX_PA17B_PTC_X13)
#define PORT_PA17B_PTC_X13                         (_UL_(1) << 17)

#define PIN_PA18B_PTC_X14                          _UL_(18)    
#define MUX_PA18B_PTC_X14                          _UL_(1)     
#define PINMUX_PA18B_PTC_X14                       ((PIN_PA18B_PTC_X14 << 16) | MUX_PA18B_PTC_X14)
#define PORT_PA18B_PTC_X14                         (_UL_(1) << 18)

#define PIN_PA19B_PTC_X15                          _UL_(19)    
#define MUX_PA19B_PTC_X15                          _UL_(1)     
#define PINMUX_PA19B_PTC_X15                       ((PIN_PA19B_PTC_X15 << 16) | MUX_PA19B_PTC_X15)
#define PORT_PA19B_PTC_X15                         (_UL_(1) << 19)

#define PIN_PA22B_PTC_X16                          _UL_(22)    
#define MUX_PA22B_PTC_X16                          _UL_(1)     
#define PINMUX_PA22B_PTC_X16                       ((PIN_PA22B_PTC_X16 << 16) | MUX_PA22B_PTC_X16)
#define PORT_PA22B_PTC_X16                         (_UL_(1) << 22)

#define PIN_PA23B_PTC_X17                          _UL_(23)    
#define MUX_PA23B_PTC_X17                          _UL_(1)     
#define PINMUX_PA23B_PTC_X17                       ((PIN_PA23B_PTC_X17 << 16) | MUX_PA23B_PTC_X17)
#define PORT_PA23B_PTC_X17                         (_UL_(1) << 23)

#define PIN_PA30B_PTC_X18                          _UL_(30)    
#define MUX_PA30B_PTC_X18                          _UL_(1)     
#define PINMUX_PA30B_PTC_X18                       ((PIN_PA30B_PTC_X18 << 16) | MUX_PA30B_PTC_X18)
#define PORT_PA30B_PTC_X18                         (_UL_(1) << 30)

#define PIN_PA31B_PTC_X19                          _UL_(31)    
#define MUX_PA31B_PTC_X19                          _UL_(1)     
#define PINMUX_PA31B_PTC_X19                       ((PIN_PA31B_PTC_X19 << 16) | MUX_PA31B_PTC_X19)
#define PORT_PA31B_PTC_X19                         (_UL_(1) << 31)

#define PIN_PB08B_PTC_X20                          _UL_(40)    
#define MUX_PB08B_PTC_X20                          _UL_(1)     
#define PINMUX_PB08B_PTC_X20                       ((PIN_PB08B_PTC_X20 << 16) | MUX_PB08B_PTC_X20)
#define PORT_PB08B_PTC_X20                         (_UL_(1) << 8)

#define PIN_PB09B_PTC_X21                          _UL_(41)    
#define MUX_PB09B_PTC_X21                          _UL_(1)     
#define PINMUX_PB09B_PTC_X21                       ((PIN_PB09B_PTC_X21 << 16) | MUX_PB09B_PTC_X21)
#define PORT_PB09B_PTC_X21                         (_UL_(1) << 9)

#define PIN_PA20B_PTC_X22                          _UL_(20)    
#define MUX_PA20B_PTC_X22                          _UL_(1)     
#define PINMUX_PA20B_PTC_X22                       ((PIN_PA20B_PTC_X22 << 16) | MUX_PA20B_PTC_X22)
#define PORT_PA20B_PTC_X22                         (_UL_(1) << 20)

#define PIN_PA21B_PTC_X23                          _UL_(21)    
#define MUX_PA21B_PTC_X23                          _UL_(1)     
#define PINMUX_PA21B_PTC_X23                       ((PIN_PA21B_PTC_X23 << 16) | MUX_PA21B_PTC_X23)
#define PORT_PA21B_PTC_X23                         (_UL_(1) << 21)

