Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.0.110/include/pio/pic32cm1216le00048.h
#define PIN_PA12B_PTC_X24                          _UL_(12)    
#define MUX_PA12B_PTC_X24                          _UL_(1)     
#define PINMUX_PA12B_PTC_X24                       ((PIN_PA12B_PTC_X24 << 16) | MUX_PA12B_PTC_X24)
#define PORT_PA12B_PTC_X24                         (_UL_(1) << 12)

#define PIN_PA13B_PTC_X25                          _UL_(13)    
#define MUX_PA13B_PTC_X25                          _UL_(1)     
#define PINMUX_PA13B_PTC_X25                       ((PIN_PA13B_PTC_X25 << 16) | MUX_PA13B_PTC_X25)
#define PORT_PA13B_PTC_X25                         (_UL_(1) << 13)

#define PIN_PA00B_PTC_Y0                           _UL_(0)     
#define MUX_PA00B_PTC_Y0                           _UL_(1)     
#define PINMUX_PA00B_PTC_Y0                        ((PIN_PA00B_PTC_Y0 << 16) | MUX_PA00B_PTC_Y0)
#define PORT_PA00B_PTC_Y0                          (_UL_(1) << 0)

#define PIN_PA01B_PTC_Y1                           _UL_(1)     
#define MUX_PA01B_PTC_Y1                           _UL_(1)     
#define PINMUX_PA01B_PTC_Y1                        ((PIN_PA01B_PTC_Y1 << 16) | MUX_PA01B_PTC_Y1)
#define PORT_PA01B_PTC_Y1                          (_UL_(1) << 1)

#define PIN_PA02B_PTC_Y2                           _UL_(2)     
#define MUX_PA02B_PTC_Y2                           _UL_(1)     
#define PINMUX_PA02B_PTC_Y2                        ((PIN_PA02B_PTC_Y2 << 16) | MUX_PA02B_PTC_Y2)
#define PORT_PA02B_PTC_Y2                          (_UL_(1) << 2)

#define PIN_PA03B_PTC_Y3                           _UL_(3)     
#define MUX_PA03B_PTC_Y3                           _UL_(1)     
#define PINMUX_PA03B_PTC_Y3                        ((PIN_PA03B_PTC_Y3 << 16) | MUX_PA03B_PTC_Y3)
#define PORT_PA03B_PTC_Y3                          (_UL_(1) << 3)

#define PIN_PA05B_PTC_Y4                           _UL_(5)     
#define MUX_PA05B_PTC_Y4                           _UL_(1)     
#define PINMUX_PA05B_PTC_Y4                        ((PIN_PA05B_PTC_Y4 << 16) | MUX_PA05B_PTC_Y4)
#define PORT_PA05B_PTC_Y4                          (_UL_(1) << 5)

#define PIN_PA06B_PTC_Y5                           _UL_(6)     
#define MUX_PA06B_PTC_Y5                           _UL_(1)     
#define PINMUX_PA06B_PTC_Y5                        ((PIN_PA06B_PTC_Y5 << 16) | MUX_PA06B_PTC_Y5)
#define PORT_PA06B_PTC_Y5                          (_UL_(1) << 6)

#define PIN_PA08B_PTC_Y6                           _UL_(8)     
#define MUX_PA08B_PTC_Y6                           _UL_(1)     
#define PINMUX_PA08B_PTC_Y6                        ((PIN_PA08B_PTC_Y6 << 16) | MUX_PA08B_PTC_Y6)
#define PORT_PA08B_PTC_Y6                          (_UL_(1) << 8)

#define PIN_PA09B_PTC_Y7                           _UL_(9)     
#define MUX_PA09B_PTC_Y7                           _UL_(1)     
#define PINMUX_PA09B_PTC_Y7                        ((PIN_PA09B_PTC_Y7 << 16) | MUX_PA09B_PTC_Y7)
#define PORT_PA09B_PTC_Y7                          (_UL_(1) << 9)

#define PIN_PA10B_PTC_Y8                           _UL_(10)    
#define MUX_PA10B_PTC_Y8                           _UL_(1)     
#define PINMUX_PA10B_PTC_Y8                        ((PIN_PA10B_PTC_Y8 << 16) | MUX_PA10B_PTC_Y8)
#define PORT_PA10B_PTC_Y8                          (_UL_(1) << 10)

#define PIN_PA11B_PTC_Y9                           _UL_(11)    
#define MUX_PA11B_PTC_Y9                           _UL_(1)     
#define PINMUX_PA11B_PTC_Y9                        ((PIN_PA11B_PTC_Y9 << 16) | MUX_PA11B_PTC_Y9)
#define PORT_PA11B_PTC_Y9                          (_UL_(1) << 11)

#define PIN_PA14B_PTC_Y10                          _UL_(14)    
#define MUX_PA14B_PTC_Y10                          _UL_(1)     
#define PINMUX_PA14B_PTC_Y10                       ((PIN_PA14B_PTC_Y10 << 16) | MUX_PA14B_PTC_Y10)
#define PORT_PA14B_PTC_Y10                         (_UL_(1) << 14)

#define PIN_PA15B_PTC_Y11                          _UL_(15)    
#define MUX_PA15B_PTC_Y11                          _UL_(1)     
#define PINMUX_PA15B_PTC_Y11                       ((PIN_PA15B_PTC_Y11 << 16) | MUX_PA15B_PTC_Y11)
#define PORT_PA15B_PTC_Y11                         (_UL_(1) << 15)

#define PIN_PA16B_PTC_Y12                          _UL_(16)    
#define MUX_PA16B_PTC_Y12                          _UL_(1)     
#define PINMUX_PA16B_PTC_Y12                       ((PIN_PA16B_PTC_Y12 << 16) | MUX_PA16B_PTC_Y12)
#define PORT_PA16B_PTC_Y12                         (_UL_(1) << 16)

#define PIN_PA17B_PTC_Y13                          _UL_(17)    
#define MUX_PA17B_PTC_Y13                          _UL_(1)     
#define PINMUX_PA17B_PTC_Y13                       ((PIN_PA17B_PTC_Y13 << 16) | MUX_PA17B_PTC_Y13)
#define PORT_PA17B_PTC_Y13                         (_UL_(1) << 17)

#define PIN_PA18B_PTC_Y14                          _UL_(18)    
#define MUX_PA18B_PTC_Y14                          _UL_(1)     
#define PINMUX_PA18B_PTC_Y14                       ((PIN_PA18B_PTC_Y14 << 16) | MUX_PA18B_PTC_Y14)
#define PORT_PA18B_PTC_Y14                         (_UL_(1) << 18)

#define PIN_PA19B_PTC_Y15                          _UL_(19)    
#define MUX_PA19B_PTC_Y15                          _UL_(1)     
#define PINMUX_PA19B_PTC_Y15                       ((PIN_PA19B_PTC_Y15 << 16) | MUX_PA19B_PTC_Y15)
#define PORT_PA19B_PTC_Y15                         (_UL_(1) << 19)

#define PIN_PA22B_PTC_Y16                          _UL_(22)    
#define MUX_PA22B_PTC_Y16                          _UL_(1)     
#define PINMUX_PA22B_PTC_Y16                       ((PIN_PA22B_PTC_Y16 << 16) | MUX_PA22B_PTC_Y16)
#define PORT_PA22B_PTC_Y16                         (_UL_(1) << 22)

#define PIN_PA23B_PTC_Y17                          _UL_(23)    
#define MUX_PA23B_PTC_Y17                          _UL_(1)     
#define PINMUX_PA23B_PTC_Y17                       ((PIN_PA23B_PTC_Y17 << 16) | MUX_PA23B_PTC_Y17)
#define PORT_PA23B_PTC_Y17                         (_UL_(1) << 23)

#define PIN_PA30B_PTC_Y18                          _UL_(30)    
#define MUX_PA30B_PTC_Y18                          _UL_(1)     
#define PINMUX_PA30B_PTC_Y18                       ((PIN_PA30B_PTC_Y18 << 16) | MUX_PA30B_PTC_Y18)
#define PORT_PA30B_PTC_Y18                         (_UL_(1) << 30)

