Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.0.110/include/pio/pic32cm1216le00048.h
#define PIN_PA31B_PTC_Y19                          _UL_(31)    
#define MUX_PA31B_PTC_Y19                          _UL_(1)     
#define PINMUX_PA31B_PTC_Y19                       ((PIN_PA31B_PTC_Y19 << 16) | MUX_PA31B_PTC_Y19)
#define PORT_PA31B_PTC_Y19                         (_UL_(1) << 31)

#define PIN_PB08B_PTC_Y20                          _UL_(40)    
#define MUX_PB08B_PTC_Y20                          _UL_(1)     
#define PINMUX_PB08B_PTC_Y20                       ((PIN_PB08B_PTC_Y20 << 16) | MUX_PB08B_PTC_Y20)
#define PORT_PB08B_PTC_Y20                         (_UL_(1) << 8)

#define PIN_PB09B_PTC_Y21                          _UL_(41)    
#define MUX_PB09B_PTC_Y21                          _UL_(1)     
#define PINMUX_PB09B_PTC_Y21                       ((PIN_PB09B_PTC_Y21 << 16) | MUX_PB09B_PTC_Y21)
#define PORT_PB09B_PTC_Y21                         (_UL_(1) << 9)

#define PIN_PA20B_PTC_Y22                          _UL_(20)    
#define MUX_PA20B_PTC_Y22                          _UL_(1)     
#define PINMUX_PA20B_PTC_Y22                       ((PIN_PA20B_PTC_Y22 << 16) | MUX_PA20B_PTC_Y22)
#define PORT_PA20B_PTC_Y22                         (_UL_(1) << 20)

#define PIN_PA21B_PTC_Y23                          _UL_(21)    
#define MUX_PA21B_PTC_Y23                          _UL_(1)     
#define PINMUX_PA21B_PTC_Y23                       ((PIN_PA21B_PTC_Y23 << 16) | MUX_PA21B_PTC_Y23)
#define PORT_PA21B_PTC_Y23                         (_UL_(1) << 21)

#define PIN_PA12B_PTC_Y24                          _UL_(12)    
#define MUX_PA12B_PTC_Y24                          _UL_(1)     
#define PINMUX_PA12B_PTC_Y24                       ((PIN_PA12B_PTC_Y24 << 16) | MUX_PA12B_PTC_Y24)
#define PORT_PA12B_PTC_Y24                         (_UL_(1) << 12)

#define PIN_PA13B_PTC_Y25                          _UL_(13)    
#define MUX_PA13B_PTC_Y25                          _UL_(1)     
#define PINMUX_PA13B_PTC_Y25                       ((PIN_PA13B_PTC_Y25 << 16) | MUX_PA13B_PTC_Y25)
#define PORT_PA13B_PTC_Y25                         (_UL_(1) << 13)

/* ========== PORT definition for RTC peripheral ========== */
#define PIN_PA08G_RTC_IN0                          _UL_(8)     
#define MUX_PA08G_RTC_IN0                          _UL_(6)     
#define PINMUX_PA08G_RTC_IN0                       ((PIN_PA08G_RTC_IN0 << 16) | MUX_PA08G_RTC_IN0)
#define PORT_PA08G_RTC_IN0                         (_UL_(1) << 8)

#define PIN_PA09G_RTC_IN1                          _UL_(9)     
#define MUX_PA09G_RTC_IN1                          _UL_(6)     
#define PINMUX_PA09G_RTC_IN1                       ((PIN_PA09G_RTC_IN1 << 16) | MUX_PA09G_RTC_IN1)
#define PORT_PA09G_RTC_IN1                         (_UL_(1) << 9)

#define PIN_PA16G_RTC_IN2                          _UL_(16)    
#define MUX_PA16G_RTC_IN2                          _UL_(6)     
#define PINMUX_PA16G_RTC_IN2                       ((PIN_PA16G_RTC_IN2 << 16) | MUX_PA16G_RTC_IN2)
#define PORT_PA16G_RTC_IN2                         (_UL_(1) << 16)

#define PIN_PA17G_RTC_IN3                          _UL_(17)    
#define MUX_PA17G_RTC_IN3                          _UL_(6)     
#define PINMUX_PA17G_RTC_IN3                       ((PIN_PA17G_RTC_IN3 << 16) | MUX_PA17G_RTC_IN3)
#define PORT_PA17G_RTC_IN3                         (_UL_(1) << 17)

#define PIN_PA18G_RTC_OUT0                         _UL_(18)    
#define MUX_PA18G_RTC_OUT0                         _UL_(6)     
#define PINMUX_PA18G_RTC_OUT0                      ((PIN_PA18G_RTC_OUT0 << 16) | MUX_PA18G_RTC_OUT0)
#define PORT_PA18G_RTC_OUT0                        (_UL_(1) << 18)

#define PIN_PA19G_RTC_OUT1                         _UL_(19)    
#define MUX_PA19G_RTC_OUT1                         _UL_(6)     
#define PINMUX_PA19G_RTC_OUT1                      ((PIN_PA19G_RTC_OUT1 << 16) | MUX_PA19G_RTC_OUT1)
#define PORT_PA19G_RTC_OUT1                        (_UL_(1) << 19)

#define PIN_PA22G_RTC_OUT2                         _UL_(22)    
#define MUX_PA22G_RTC_OUT2                         _UL_(6)     
#define PINMUX_PA22G_RTC_OUT2                      ((PIN_PA22G_RTC_OUT2 << 16) | MUX_PA22G_RTC_OUT2)
#define PORT_PA22G_RTC_OUT2                        (_UL_(1) << 22)

#define PIN_PA23G_RTC_OUT3                         _UL_(23)    
#define MUX_PA23G_RTC_OUT3                         _UL_(6)     
#define PINMUX_PA23G_RTC_OUT3                      ((PIN_PA23G_RTC_OUT3 << 16) | MUX_PA23G_RTC_OUT3)
#define PORT_PA23G_RTC_OUT3                        (_UL_(1) << 23)

/* ========== PORT definition for SERCOM0 peripheral ========== */
#define PIN_PA04D_SERCOM0_PAD0                     _UL_(4)     
#define MUX_PA04D_SERCOM0_PAD0                     _UL_(3)     
#define PINMUX_PA04D_SERCOM0_PAD0                  ((PIN_PA04D_SERCOM0_PAD0 << 16) | MUX_PA04D_SERCOM0_PAD0)
#define PORT_PA04D_SERCOM0_PAD0                    (_UL_(1) << 4)

#define PIN_PA16D_SERCOM0_PAD0                     _UL_(16)    
#define MUX_PA16D_SERCOM0_PAD0                     _UL_(3)     
#define PINMUX_PA16D_SERCOM0_PAD0                  ((PIN_PA16D_SERCOM0_PAD0 << 16) | MUX_PA16D_SERCOM0_PAD0)
#define PORT_PA16D_SERCOM0_PAD0                    (_UL_(1) << 16)

#define PIN_PA22C_SERCOM0_PAD0                     _UL_(22)    
#define MUX_PA22C_SERCOM0_PAD0                     _UL_(2)     
#define PINMUX_PA22C_SERCOM0_PAD0                  ((PIN_PA22C_SERCOM0_PAD0 << 16) | MUX_PA22C_SERCOM0_PAD0)
#define PORT_PA22C_SERCOM0_PAD0                    (_UL_(1) << 22)

#define PIN_PA05D_SERCOM0_PAD1                     _UL_(5)     
#define MUX_PA05D_SERCOM0_PAD1                     _UL_(3)     
#define PINMUX_PA05D_SERCOM0_PAD1                  ((PIN_PA05D_SERCOM0_PAD1 << 16) | MUX_PA05D_SERCOM0_PAD1)
#define PORT_PA05D_SERCOM0_PAD1                    (_UL_(1) << 5)

#define PIN_PA17D_SERCOM0_PAD1                     _UL_(17)    
#define MUX_PA17D_SERCOM0_PAD1                     _UL_(3)     
#define PINMUX_PA17D_SERCOM0_PAD1                  ((PIN_PA17D_SERCOM0_PAD1 << 16) | MUX_PA17D_SERCOM0_PAD1)
#define PORT_PA17D_SERCOM0_PAD1                    (_UL_(1) << 17)

#define PIN_PA23C_SERCOM0_PAD1                     _UL_(23)    
#define MUX_PA23C_SERCOM0_PAD1                     _UL_(2)     
#define PINMUX_PA23C_SERCOM0_PAD1                  ((PIN_PA23C_SERCOM0_PAD1 << 16) | MUX_PA23C_SERCOM0_PAD1)
#define PORT_PA23C_SERCOM0_PAD1                    (_UL_(1) << 23)

#define PIN_PA06D_SERCOM0_PAD2                     _UL_(6)     
#define MUX_PA06D_SERCOM0_PAD2                     _UL_(3)     
#define PINMUX_PA06D_SERCOM0_PAD2                  ((PIN_PA06D_SERCOM0_PAD2 << 16) | MUX_PA06D_SERCOM0_PAD2)
#define PORT_PA06D_SERCOM0_PAD2                    (_UL_(1) << 6)

#define PIN_PA14D_SERCOM0_PAD2                     _UL_(14)    
#define MUX_PA14D_SERCOM0_PAD2                     _UL_(3)     
#define PINMUX_PA14D_SERCOM0_PAD2                  ((PIN_PA14D_SERCOM0_PAD2 << 16) | MUX_PA14D_SERCOM0_PAD2)
#define PORT_PA14D_SERCOM0_PAD2                    (_UL_(1) << 14)

#define PIN_PA18D_SERCOM0_PAD2                     _UL_(18)    
#define MUX_PA18D_SERCOM0_PAD2                     _UL_(3)     
#define PINMUX_PA18D_SERCOM0_PAD2                  ((PIN_PA18D_SERCOM0_PAD2 << 16) | MUX_PA18D_SERCOM0_PAD2)
#define PORT_PA18D_SERCOM0_PAD2                    (_UL_(1) << 18)

#define PIN_PA24C_SERCOM0_PAD2                     _UL_(24)    
#define MUX_PA24C_SERCOM0_PAD2                     _UL_(2)     
#define PINMUX_PA24C_SERCOM0_PAD2                  ((PIN_PA24C_SERCOM0_PAD2 << 16) | MUX_PA24C_SERCOM0_PAD2)
#define PORT_PA24C_SERCOM0_PAD2                    (_UL_(1) << 24)

#define PIN_PB22C_SERCOM0_PAD2                     _UL_(54)    
#define MUX_PB22C_SERCOM0_PAD2                     _UL_(2)     
#define PINMUX_PB22C_SERCOM0_PAD2                  ((PIN_PB22C_SERCOM0_PAD2 << 16) | MUX_PB22C_SERCOM0_PAD2)
#define PORT_PB22C_SERCOM0_PAD2                    (_UL_(1) << 22)

#define PIN_PA02D_SERCOM0_PAD2                     _UL_(2)     
#define MUX_PA02D_SERCOM0_PAD2                     _UL_(3)     
#define PINMUX_PA02D_SERCOM0_PAD2                  ((PIN_PA02D_SERCOM0_PAD2 << 16) | MUX_PA02D_SERCOM0_PAD2)
#define PORT_PA02D_SERCOM0_PAD2                    (_UL_(1) << 2)

#define PIN_PA07D_SERCOM0_PAD3                     _UL_(7)     
#define MUX_PA07D_SERCOM0_PAD3                     _UL_(3)     
#define PINMUX_PA07D_SERCOM0_PAD3                  ((PIN_PA07D_SERCOM0_PAD3 << 16) | MUX_PA07D_SERCOM0_PAD3)
#define PORT_PA07D_SERCOM0_PAD3                    (_UL_(1) << 7)

